Infineon/AURIX_code_examples/code_examples/OneEye_DAS_QuickStart_1_KIT_TC375_LK/Libraries/iLLD/TC3xx/Tricore/_Impl/IfxMtu_cfg_TC37xED.c
/**
 * \file IfxMtu_cfg_TC37xED.c
 * \brief Mtu on-chip implementation data
 *
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "Ifx_Cfg.h"
#if defined (__TASKING__)
#pragma warning 508		    /* To suppress empty file warning */
#endif
#if defined (__ghs__)
#pragma diag_suppress 96	/* To suppress empty file warning */
#endif

#if defined DEVICE_TC37XED
#include "IfxMtu_cfg_TC37xED.h"
#include "Mtu/Std/IfxMtu.h"

/******************************************************************************/
/*-----------------------Exported Variables/Constants-------------------------*/
/******************************************************************************/

const IfxMtu_SramItem           IfxMtu_sramTable[IFXMTU_NUM_MBIST_TABLE_ITEMS] = {
    {2 * 4, 16,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu0Dspr0 */
    {2 * 1, 19,  10, 0, 4}, /**< \brief IfxMtu_MbistSel_cpu0Dtag */
    {2 * 2, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu0Pspr */
    {2 * 1, 19,  10, 0, 4}, /**< \brief IfxMtu_MbistSel_cpu0Ptag */
    {2 * 1, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu0Dlmu */
    {2 * 4, 16,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu1Dspr0 */
    {2 * 1, 19,  10, 0, 4}, /**< \brief IfxMtu_MbistSel_cpu1Dtag */
    {2 * 2, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu1Pspr */
    {2 * 1, 19,  10, 0, 4}, /**< \brief IfxMtu_MbistSel_cpu1Ptag */
    {2 * 1, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu1Dlmu */
    {2 * 4, 16,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu2Dspr */
    {2 * 1, 19,  10, 0, 4}, /**< \brief IfxMtu_MbistSel_cpu2Dtag */
    {2 * 2, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu2Pspr */
    {2 * 1, 19,  10, 0, 4}, /**< \brief IfxMtu_MbistSel_cpu2Ptag */
    {2 * 1, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu2Dlmu */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {2 * 4, 16,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu0Dspr1 */
    {2 * 4, 16,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_cpu1Dspr1 */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 2, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_dam0 */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 4, 64,  8,  0, 1}, /**< \brief IfxMtu_MbistSel_dma */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 5, 32,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_mcds */
    {1 * 4, 256, 10, 0, 1}, /**< \brief IfxMtu_MbistSel_ememUpper0 */
    {1 * 4, 256, 10, 0, 1}, /**< \brief IfxMtu_MbistSel_ememUpper1 */
    {1 * 4, 256, 10, 0, 1}, /**< \brief IfxMtu_MbistSel_ememUpper2 */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 4, 128, 9,  0, 1}, /**< \brief IfxMtu_MbistSel_ememXtm */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 3, 29,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_gtmFifo */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 5, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_gtmMcs0 */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 5, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_gtmMcs01 */
    {1 * 1, 24,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_gtmDpll1a */
    {1 * 1, 24,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_gtmDpll1b */
    {1 * 1, 24,  6,  0, 1}, /**< \brief IfxMtu_MbistSel_gtmDpll2 */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 1, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_mcan0 */
    {1 * 1, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_mcan1 */
    {1 * 1, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_mcan2 */
    {1 * 1, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_psi5 */
    {1 * 2, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_eray0Obf */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 4, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_eray0IbfTbf */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 1, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_eray0Mbf */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {2 * 2, 8,   5,  0, 1}, /**< \brief IfxMtu_MbistSel_scrXram */
    {1 * 1, 8,   5,  0, 1}, /**< \brief IfxMtu_MbistSel_scrIram */
    {1 * 4, 8,   5,  0, 1}, /**< \brief IfxMtu_MbistSel_cifJpeg1_4 */
    {1 * 2, 8,   5,  0, 1}, /**< \brief IfxMtu_MbistSel_cifJpeg3 */
    {1 * 1, 36,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_cifCif */
    {1 * 2, 35,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_ethermacRx */
    {1 * 2, 35,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_ethermacTx */
    {1 * 1, 32,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_sdmmc */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {1 * 2, 35,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_ethermacRx1 */
    {1 * 2, 35,  7,  0, 1}, /**< \brief IfxMtu_MbistSel_ethermacTx1 */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
    {0 * 0, 0,   0,  0, 0}, /**< \brief IfxMtu_MbistSel_none */
};

const IfxMtu_MbistConfigPattern nonDestructiveTestPattern[] = {
    {
        IFXMTU_MBIST_CONFIG_NONDISTTEST_CONFIG0,
        IFXMTU_MBIST_CONFIG_NONDISTTEST_CONFIG1
    }
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang0[] = {
    {
        IfxMtu_MbistSel_cpu0Dlmu,                           /* sshSel          */
        0x00,                                               /* lowAddress      */
        0x3F,                                               /* highAddress     */
        5,                                                  /* uncorrectableErrorThreshold*/
        0                                                    /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu0Dspr1,                          /* sshSel          */
        0x00,                                               /* lowAddress      */
        0x7F,                                               /* highAddress     */
        5,                                                  /* uncorrectableErrorThreshold*/
        0                                                   /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_mcan0,                              /* sshSel          */
        0x00,                                               /* lowAddress      */
        0x7F,                                               /* highAddress     */
        5,                                                  /* uncorrectableErrorThreshold*/
        1                                                   /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_mcan1,                              /* sshSel          */
        0x00,                                               /* lowAddress      */
        0x3F,                                               /* highAddress     */
        5,                                                  /* uncorrectableErrorThreshold*/
        1                                                   /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_mcan2,                              /* sshSel          */
        0x00,                                               /* lowAddress      */
        0x3F,                                               /* highAddress     */
        5,                                                  /* uncorrectableErrorThreshold*/
        1                                                   /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_eray0Mbf,                           /* sshSel          */
        0x00,                                               /* lowAddress      */
        0x1F,                                               /* highAddress     */
        5,                                                  /* uncorrectableErrorThreshold*/
        1                                                   /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_scrXram,                            /* sshSel          */
        0x00,                                               /* lowAddress      */
        0x1F,                                               /* highAddress     */
        5,                                                  /* uncorrectableErrorThreshold*/
        1                                                   /* preClearEnable  */
    },
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang1[] = {
    {
        IfxMtu_MbistSel_cpu0Dspr,                             /* sshSel          */
        0x00,                                                 /* lowAddress      */
        0x7F,                                                 /* highAddress     */
        5,                                                    /* uncorrectableErrorThreshold*/
        0                                                     /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu1Dspr1,                            /* sshSel          */
        0x00,                                                 /* lowAddress      */
        0x7F,                                                 /* highAddress     */
        5,                                                    /* uncorrectableErrorThreshold*/
        0                                                     /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmFifo,                              /* sshSel          */
        0x00,                                                 /* lowAddress      */
        0xF,                                                  /* highAddress     */
        5,                                                    /* uncorrectableErrorThreshold*/
        1                                                     /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmDpll2,                             /* sshSel          */
        0x00,                                                 /* lowAddress      */
        0x3F,                                                 /* highAddress     */
        5,                                                    /* uncorrectableErrorThreshold*/
        1                                                     /* preClearEnable  */
    },
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang2[] = {
    {
        IfxMtu_MbistSel_cpu1Dspr,                          /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x7F,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        0                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu2Dspr,                          /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x6F,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        0                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmDpll1b,                         /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x5,                                               /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_psi5,                              /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x03,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang3[] = {
    {
        IfxMtu_MbistSel_cpu0Pspr,                              /* sshSel          */
        0x00,                                                  /* lowAddress      */
        0x2F,                                                  /* highAddress     */
        5,                                                     /* uncorrectableErrorThreshold*/
        0                                                      /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu0Ptag,                              /* sshSel          */
        0x00,                                                  /* lowAddress      */
        0x7,                                                   /* highAddress     */
        5,                                                     /* uncorrectableErrorThreshold*/
        0                                                      /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu1Dlmu,                              /* sshSel          */
        0x00,                                                  /* lowAddress      */
        0x3F,                                                  /* highAddress     */
        5,                                                     /* uncorrectableErrorThreshold*/
        0                                                      /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu2Dlmu,                              /* sshSel          */
        0x00,                                                  /* lowAddress      */
        0x3F,                                                  /* highAddress     */
        5,                                                     /* uncorrectableErrorThreshold*/
        0                                                      /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmMcs0Fast,                           /* sshSel          */
        0x00,                                                  /* lowAddress      */
        0x1F,                                                  /* highAddress     */
        5,                                                     /* uncorrectableErrorThreshold*/
        1                                                      /* preClearEnable  */
    },
};

