Infineon/AURIX_code_examples/code_examples/OneEye_DAS_QuickStart_1_KIT_TC375_LK/Libraries/iLLD/TC3xx/Tricore/_Impl/IfxMtu_cfg_TC37xED.c
const IfxMtu_MbistSshConfig     mbistSshConfigGang4[] = {
    {
        IfxMtu_MbistSel_cpu1Pspr,                         /* sshSel          */
        0x00,                                             /* lowAddress      */
        0x2F,                                             /* highAddress     */
        5,                                                /* uncorrectableErrorThreshold*/
        0                                                 /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu1Ptag,                         /* sshSel          */
        0x00,                                             /* lowAddress      */
        0x7,                                              /* highAddress     */
        5,                                                /* uncorrectableErrorThreshold*/
        1                                                 /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu2Pspr,                         /* sshSel          */
        0x00,                                             /* lowAddress      */
        0x2F,                                             /* highAddress     */
        5,                                                /* uncorrectableErrorThreshold*/
        0                                                 /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu2Ptag,                         /* sshSel          */
        0x00,                                             /* lowAddress      */
        0x7,                                              /* highAddress     */
        5,                                                /* uncorrectableErrorThreshold*/
        1                                                 /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_dma,                              /* sshSel          */
        0x00,                                             /* lowAddress      */
        0x01,                                             /* highAddress     */
        5,                                                /* uncorrectableErrorThreshold*/
        1                                                 /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmMcs1Fast,                      /* sshSel          */
        0x00,                                             /* lowAddress      */
        0x0F,                                             /* highAddress     */
        5,                                                /* uncorrectableErrorThreshold*/
        1                                                 /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_scrIram,                          /* sshSel          */
        0x00,                                             /* lowAddress      */
        0x04,                                             /* highAddress     */
        5,                                                /* uncorrectableErrorThreshold*/
        1                                                 /* preClearEnable  */
    },
};

const IfxMtu_MbistSshConfig     mbistSshConfigGang5[] = {
    {
        IfxMtu_MbistSel_cpu0Dtag,                          /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x03,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu1Dtag,                          /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x03,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_cpu2Dtag,                          /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x03,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_mcds,                              /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x0F,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_gtmDpll1a,                         /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x01,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_eray0Obf,                          /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x00,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_eray0IbfTbf,                       /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x00,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
    {
        IfxMtu_MbistSel_sdmmc,                             /* sshSel          */
        0x00,                                              /* lowAddress      */
        0x03,                                              /* highAddress     */
        5,                                                 /* uncorrectableErrorThreshold*/
        1                                                  /* preClearEnable  */
    },
};

const IfxMtu_MbistConfig        mbistGang0Config = {
    IFXMTU_MBIST_CONFIG_NONDISTTEST_MCONTROL,                             /* mcontrol        */
    sizeof(mbistSshConfigGang0) / sizeof(IfxMtu_MbistSshConfig),
    sizeof(nonDestructiveTestPattern) / sizeof(IfxMtu_MbistConfigPattern),
    mbistSshConfigGang0,
    nonDestructiveTestPattern
};

const IfxMtu_MbistConfig        mbistGang1Config = {
    IFXMTU_MBIST_CONFIG_NONDISTTEST_MCONTROL,                             /* mcontrol        */
    sizeof(mbistSshConfigGang1) / sizeof(IfxMtu_MbistSshConfig),
    sizeof(nonDestructiveTestPattern) / sizeof(IfxMtu_MbistConfigPattern),
    mbistSshConfigGang1,
    nonDestructiveTestPattern
};

const IfxMtu_MbistConfig        mbistGang2Config = {
    IFXMTU_MBIST_CONFIG_NONDISTTEST_MCONTROL,                             /* mcontrol        */
    sizeof(mbistSshConfigGang2) / sizeof(IfxMtu_MbistSshConfig),
    sizeof(nonDestructiveTestPattern) / sizeof(IfxMtu_MbistConfigPattern),
    mbistSshConfigGang2,
    nonDestructiveTestPattern
};

const IfxMtu_MbistConfig        mbistGang3Config = {
    IFXMTU_MBIST_CONFIG_NONDISTTEST_MCONTROL,                             /* mcontrol        */
    sizeof(mbistSshConfigGang3) / sizeof(IfxMtu_MbistSshConfig),
    sizeof(nonDestructiveTestPattern) / sizeof(IfxMtu_MbistConfigPattern),
    mbistSshConfigGang3,
    nonDestructiveTestPattern
};

const IfxMtu_MbistConfig        mbistGang4Config = {
    IFXMTU_MBIST_CONFIG_NONDISTTEST_MCONTROL,                             /* mcontrol        */
    sizeof(mbistSshConfigGang4) / sizeof(IfxMtu_MbistSshConfig),
    sizeof(nonDestructiveTestPattern) / sizeof(IfxMtu_MbistConfigPattern),
    mbistSshConfigGang4,
    nonDestructiveTestPattern
};

const IfxMtu_MbistConfig        mbistGang5Config = {
    IFXMTU_MBIST_CONFIG_NONDISTTEST_MCONTROL,                             /* mcontrol        */
    sizeof(mbistSshConfigGang5) / sizeof(IfxMtu_MbistSshConfig),
    sizeof(nonDestructiveTestPattern) / sizeof(IfxMtu_MbistConfigPattern),
    mbistSshConfigGang5,
    nonDestructiveTestPattern
};

const IfxMtu_MbistConfig *const mbistGangConfig[] = {
    &mbistGang0Config,
    &mbistGang1Config,
    &mbistGang2Config,
    &mbistGang3Config,
    &mbistGang4Config,
    &mbistGang5Config,
    (void *)0 //End indicator
};
#endif
#if defined (_TASKING_) || defined (_ghs_)
#pragma restore
#endif
